import numpy as np
from numpy import nan as NA
import pandas as pd

sample_data_frame = pd.DataFrame(np.random.rand(10, 4))

sample_data_frame.iloc[1, 0] = NA
sample_data_frame.iloc[2, 2] = NA
sample_data_frame.iloc[5:, 3] = NA


# 평균값 대입법
print(sample_data_frame.fillna(sample_data_frame.mean()))
#           0         1         2         3
# 0  0.582127  0.658194  0.355504  0.139656
# 1  0.447608  0.850627  0.229963  0.116295
# 2  0.240036  0.795527  0.442877  0.711758
# 3  0.644237  0.456156  0.254392  0.034592
# 4  0.307060  0.061133  0.587649  0.177947
# 5  0.325356  0.014334  0.623631  0.236049
# 6  0.605752  0.909841  0.768462  0.236049
# 7  0.230069  0.283802  0.231814  0.236049
# 8  0.434539  0.221748  0.725991  0.236049
# 9  0.659295  0.155886  0.208487  0.236049


# 문제 
np.random.seed(0)

sample_data_frame = pd.DataFrame(np.random.rand(10, 4))

sample_data_frame.iloc[1, 0] = NA
sample_data_frame.iloc[6:, 2] = NA

print(sample_data_frame.fillna(sample_data_frame.mean()))
#           0         1         2         3
# 0  0.548814  0.715189  0.602763  0.544883
# 1  0.531970  0.645894  0.437587  0.891773
# 2  0.963663  0.383442  0.791725  0.528895
# 3  0.568045  0.925597  0.071036  0.087129
# 4  0.020218  0.832620  0.778157  0.870012
# 5  0.978618  0.799159  0.461479  0.780529
# 6  0.118274  0.639921  0.523791  0.944669
# 7  0.521848  0.414662  0.523791  0.774234
# 8  0.456150  0.568434  0.523791  0.617635
# 9  0.612096  0.616934  0.523791  0.681820