import numpy as np
a = np.array([[[1, 2, 3],[1, 2, 3],[1, 2, 3]],
              [[1, 2, 3],[1, 2, 3],[1, 2, 3]]])
print(a.shape)
# (2, 3, 3)


# axis = 0
a_axis0 = np.sum(a, axis = 0)
print('a_axis0:',a_axis0)
"""
a_axis0: [[2 4 6]       [[[1, 2, 3],[1, 2, 3],[1, 2, 3]],           
          [2 4 6]        [[1, 2, 3],[1, 2, 3],[1, 2, 3]]]    
          [2 4 6]]       --------------------------------    
                          [2, 4, 6],[2, 4, 6], [2, 4, 6]     # 위에서 아래로 계산
"""


# axis = 1
a_axis1 = np.sum(a, axis = 1)
print('a_axis1:',a_axis1)
"""
a_axis1: [[3 6 9]        [[[1, 2, 3],[1, 2, 3],[1, 2, 3]],  : [3, 6, 9] # 각 [ ]의 순서 별로 계산  
          [3 6 9]]        [[1, 2, 3],[1, 2, 3],[1, 2, 3]]]  : [3, 6, 9]
                                                                      
"""


# axis = 2
a_axis2 = np.sum(a, axis = 2)
print('a_axis2:',a_axis2)
"""
a_axis2: [[6 6 6]        [[[1, 2, 3],[1, 2, 3],[1, 2, 3]],   :  [6, 6, 6]  # 한 [ ]씩 계산
          [6 6 6]]         [[1, 2, 3],[1, 2, 3],[1, 2, 3]]]  :  [6, 6, 6]                                                                
"""



# axis 마이너스 설정
# axis = -1
a_axis_1 = np.sum(a, axis = -1)
print('a_axis-1:',a_axis_1)
"""
a_axis-1: [[6 6 6]
           [6 6 6]]

# a의 마지막 차원(_, _, 3) 의 모양으로 계산 
"""


# axis = -2
a_axis_2 = np.sum(a, axis = -2)
print('a_axis-2:',a_axis_2)
"""
a_axis-2: [[3 6 9]
           [3 6 9]]

# a의 마지막에서 2번째 차원(_, 3, _) 의 모양으로 계산 
"""


# axis = -3
a_axis_3 = np.sum(a, axis = -3)
print('a_axis-3:',a_axis_3)
"""
a_axis-3: [[2 4 6]
           [2 4 6]
           [2 4 6]]

# a의 마지막에서 3번째 차원(2, _, _) 의 모양으로 계산 
"""